of60/tutorials/rheoHeatFoam/channel/PTTLog/constant/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            boussinesq;

enableViscousDissipation true;

rhoCp           rhoCp [ 1 -1 -2 -1 0 0 0 ] 1788.496584;

kappaCoeffs
{
    a0              0.03623864;
    a1              0.0000944;
    a2              0;
    a3              0;
}


// ************************************************************************* //
